In [3]:
import numpy as np
import pandas as pd

In [13]:
# In millions
g7_pop = pd.Series([35.467, 63.951, 80.940, 60.665, 127.061, 64.511, 318.523])
g7_pop

0     35.467
1     63.951
2     80.940
3     60.665
4    127.061
5     64.511
6    318.523
dtype: float64

In [15]:
g7_pop.name = 'G7 Population in millions'
g7_pop

0     35.467
1     63.951
2     80.940
3     60.665
4    127.061
5     64.511
6    318.523
Name: G7 Population in millions, dtype: float64

In [17]:
g7_pop.dtype

dtype('float64')

In [19]:
g7_pop.values

array([ 35.467,  63.951,  80.94 ,  60.665, 127.061,  64.511, 318.523])

In [21]:
type(g7_pop.values)

numpy.ndarray

In [23]:
g7_pop[0]

35.467

In [25]:
g7_pop[1]

63.951

In [27]:
g7_pop.index

RangeIndex(start=0, stop=7, step=1)

In [29]:
g7_pop.index = [
    'Canada',
    'France',
    'Germany',
    'Italy',
    'Japan',
    'United Kingdom',
    'United States',
]
g7_pop

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in millions, dtype: float64

In [31]:
pd.Series({
    'Canada': 35.467,
    'France': 63.951,
    'Germany': 80.94,
    'Italy': 60.665,
    'Japan': 127.061,
    'United Kingdom': 64.511,
    'United States': 318.523
}, name='G7 Population in millions')

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in millions, dtype: float64

In [33]:

pd.Series(
    [35.467, 63.951, 80.94, 60.665, 127.061, 64.511, 318.523],
    index=['Canada', 'France', 'Germany', 'Italy', 'Japan', 'United Kingdom',
       'United States'],
    name='G7 Population in millions')

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in millions, dtype: float64

In [35]:
pd.Series(g7_pop, index=['France', 'Germany', 'Italy', 'Spain'])

France     63.951
Germany    80.940
Italy      60.665
Spain         NaN
Name: G7 Population in millions, dtype: float64

In [39]:
g7_pop['Canada']

35.467

In [41]:
g7_pop['Japan']

127.061

In [43]:
g7_pop.iloc[0]

35.467

In [45]:
g7_pop.iloc[-1]

318.523

In [47]:
g7_pop.iloc[[0, 1]]

Canada    35.467
France    63.951
Name: G7 Population in millions, dtype: float64

In [49]:
g7_pop['Canada': 'Italy']

Canada     35.467
France     63.951
Germany    80.940
Italy      60.665
Name: G7 Population in millions, dtype: float64

In [66]:
g7_pop > 70

Canada            False
France            False
Germany            True
Italy             False
Japan              True
United Kingdom    False
United States      True
Name: G7 Population in millions, dtype: bool

In [54]:
g7_pop[g7_pop > 70]

Germany           80.940
Japan            127.061
United States    318.523
Name: G7 Population in millions, dtype: float64

In [56]:
g7_pop.mean()

107.30257142857144

In [60]:
g7_pop[g7_pop > g7_pop.mean()]

Japan            127.061
United States    318.523
Name: G7 Population in millions, dtype: float64

In [62]:
g7_pop.std()

97.24996987121581

In [64]:
g7_pop[(g7_pop > g7_pop.mean() - g7_pop.std() / 2) | (g7_pop > g7_pop.mean() + g7_pop.std() / 2)]

France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in millions, dtype: float64

In [85]:
np.array(g7_pop>70,dtype=np.int8)

array([0, 0, 1, 0, 1, 0, 1], dtype=int8)

In [87]:
g7_pop > 80

Canada            False
France            False
Germany            True
Italy             False
Japan              True
United Kingdom    False
United States      True
Name: G7 Population in millions, dtype: bool

In [89]:
g7_pop[g7_pop > 80]

Germany           80.940
Japan            127.061
United States    318.523
Name: G7 Population in millions, dtype: float64

In [91]:
g7_pop[(g7_pop > 80) | (g7_pop < 40)]

Canada            35.467
Germany           80.940
Japan            127.061
United States    318.523
Name: G7 Population in millions, dtype: float64

In [93]:
g7_pop[(g7_pop > 80) & (g7_pop < 200)]

Germany     80.940
Japan      127.061
Name: G7 Population in millions, dtype: float64

In [96]:
g7_pop*50

Canada             1773.35
France             3197.55
Germany            4047.00
Italy              3033.25
Japan              6353.05
United Kingdom     3225.55
United States     15926.15
Name: G7 Population in millions, dtype: float64

In [98]:
g7_pop.mean()

107.30257142857144

In [100]:
g7_pop['France':'United States'].mean()

119.27516666666666

In [102]:
g7_pop['Canada']=123
g7_pop['Canada']

123.0

In [104]:
g7_pop.iloc[-2]=400
g7_pop.iloc[-2]

400.0

In [106]:
g7_pop[g7_pop<70]=99.9
g7_pop

Canada            123.000
France             99.900
Germany            80.940
Italy              99.900
Japan             127.061
United Kingdom    400.000
United States     318.523
Name: G7 Population in millions, dtype: float64

In [278]:
X = ['A','B','C']
type(X)

list

In [280]:
X=pd.Series(X)
print(type(X))

<class 'pandas.core.series.Series'>

In [282]:
X.name='My letters'
X

0    A
1    B
2    C
Name: My letters, dtype: object

In [284]:
X.values

array(['A', 'B', 'C'], dtype=object)

In [286]:
X.index=['first','second','third']
X

first     A
second    B
third     C
Name: My letters, dtype: object

In [288]:
X['first']

'A'

In [266]:
X.iloc[0]

'A'

In [138]:
X.loc['first']

'A'

In [142]:
X.iloc[-1]

'C'

In [144]:
X.iloc[1:-1]

second    B
dtype: object

In [146]:
X.iloc[::-1]

third     C
second    B
first     A
dtype: object

In [152]:
X.iloc[[0,-1]]

first    A
third    C
dtype: object

In [154]:
X = pd.Series([1,2,3,4,5],index=['first','second','third','forth','fifth'])

In [158]:
pd.Series(X,dtype=np.float16)

first     1.0
second    2.0
third     3.0
forth     4.0
fifth     5.0
dtype: float16

In [160]:
pd.Series(X[::-1])

fifth     5
forth     4
third     3
second    2
first     1
dtype: int64

In [208]:
X=pd.Series([4,3,2,5,1])

In [210]:
X=X.sort_values()

In [212]:
X

4    1
2    2
1    3
0    4
3    5
dtype: int64

In [214]:
X = pd.Series([1,2,3,4,5],index=['A','B','C','D','E'])

In [222]:
X.iloc[4]=10
X.iloc[4]

10

In [226]:
X.iloc[1:-1]=0
X

A     1
B     0
C     0
D     0
E    10
dtype: int64

In [294]:
X = pd.Series([1,2,3,4,5],index=['A','B','C','D','E'])
X

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [296]:
X[1:-1] = 0
X

A    1
B    0
C    0
D    0
E    5
dtype: int64

In [300]:
X+5

A     6
B     5
C     5
D     5
E    10
dtype: int64

In [308]:
X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])
X<0

0     True
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8     True
9    False
dtype: bool

In [310]:
pd.Series(X[X<0])

0   -1
3   -4
8   -9
dtype: int64

In [312]:
X[X<0]

0   -1
3   -4
8   -9
dtype: int64

In [314]:
X[X>X.mean()]

1     2
4     5
5     6
9    10
dtype: int64

In [318]:
X[(X==2) | (X==10)]

1     2
9    10
dtype: int64

In [322]:
X = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])
X.all()#returns true if none of the elements is 0

False

In [324]:
X.any()#returns true if any of the element is 0

True

In [326]:
X.sum()

9

In [328]:
X.mean()

0.9

In [330]:
X.max()

10

In [348]:
df = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94 , 60.665, 127.061, 64.511, 318.523],
    'GDP': [
        1785387,
        2833687,
        3874437,
        2167744,
        4602367,
        2950039,
        17348075
    ],
    'Surface Area': [
        9984670,
        640679,
        357114,
        301336,
        377930,
        242495,
        9525067
    ],
    'HDI': [
        0.913,
        0.888,
        0.916,
        0.873,
        0.891,
        0.907,
        0.915
    ],
    'Continent': [
        'America',
        'Europe',
        'Europe',
        'Europe',
        'Asia',
        'Europe',
        'America'
    ]
}, columns=['Population', 'GDP', 'Surface Area', 'HDI', 'Continent'])

###it is not necesary to write the last columns: line

In [351]:
df

   Population       GDP  Surface Area    HDI Continent
0      35.467   1785387       9984670  0.913   America
1      63.951   2833687        640679  0.888    Europe
2      80.940   3874437        357114  0.916    Europe
3      60.665   2167744        301336  0.873    Europe
4     127.061   4602367        377930  0.891      Asia
5      64.511   2950039        242495  0.907    Europe
6     318.523  17348075       9525067  0.915   America

In [565]:
df.index = [
    'Canada',
    'France',
    'Germany',
    'Italy',
    'Japan',
    'United Kingdom',
    'United States',
]
df

                Population       GDP  Surface Area    HDI Continent Language
Canada              35.467   1785387       9984670  0.913   America  English
France              63.951   2833687        640679  0.888    Europe  English
Germany             80.940   3874437        357114  0.916    Europe  English
Italy               60.665   2167744        301336  0.873    Europe  English
Japan              127.061   4602367        377930  0.891      Asia  English
United Kingdom      64.511   2950039        242495  0.907    Europe  English
United States      318.523  17348075       9525067  0.915   America  English

In [357]:
df.columns

Index(['Population', 'GDP', 'Surface Area', 'HDI', 'Continent'], dtype='object')

In [359]:
df.index

Index(['Canada', 'France', 'Germany', 'Italy', 'Japan', 'United Kingdom',
       'United States'],
      dtype='object')

In [381]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Canada to United States
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Population    7 non-null      float64
 1   GDP           7 non-null      int64
 2   Surface Area  7 non-null      int64
 3   HDI           7 non-null      float64
 4   Continent     7 non-null      object
dtypes: float64(2), int64(2), object(1)
memory usage: 336.0+ bytes

In [383]:
df.size

35

In [385]:
df.shape

(7, 5)

In [371]:
df.describe()

       Population           GDP  Surface Area       HDI
count    7.000000  7.000000e+00  7.000000e+00  7.000000
mean   107.302571  5.080248e+06  3.061327e+06  0.900429
std     97.249970  5.494020e+06  4.576187e+06  0.016592
min     35.467000  1.785387e+06  2.424950e+05  0.873000
25%     62.308000  2.500716e+06  3.292250e+05  0.889500
50%     64.511000  2.950039e+06  3.779300e+05  0.907000
75%    104.000500  4.238402e+06  5.082873e+06  0.914000
max    318.523000  1.734808e+07  9.984670e+06  0.916000

In [375]:
df.dtypes

Population      float64
GDP               int64
Surface Area      int64
HDI             float64
Continent        object
dtype: object

In [379]:
df.dtypes.value_counts()

float64    2
int64      2
object     1
Name: count, dtype: int64

In [387]:
df.loc['Canada']

Population       35.467
GDP             1785387
Surface Area    9984670
HDI               0.913
Continent       America
Name: Canada, dtype: object

In [393]:
df.iloc[0]

Population       35.467
GDP             1785387
Surface Area    9984670
HDI               0.913
Continent       America
Name: Canada, dtype: object

In [401]:
df['Population']

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: Population, dtype: float64

In [409]:
df['Population'].to_frame()

                Population
Canada              35.467
France              63.951
Germany             80.940
Italy               60.665
Japan              127.061
United Kingdom      64.511
United States      318.523

In [411]:
df[['Population', 'GDP']]

                Population       GDP
Canada              35.467   1785387
France              63.951   2833687
Germany             80.940   3874437
Italy               60.665   2167744
Japan              127.061   4602367
United Kingdom      64.511   2950039
United States      318.523  17348075

In [417]:
df[1:4]

         Population      GDP  Surface Area    HDI Continent
France       63.951  2833687        640679  0.888    Europe
Germany      80.940  3874437        357114  0.916    Europe
Italy        60.665  2167744        301336  0.873    Europe

In [419]:
df.loc['France': 'Germany']

         Population      GDP  Surface Area    HDI Continent
France       63.951  2833687        640679  0.888    Europe
Germany      80.940  3874437        357114  0.916    Europe

In [429]:
df.loc['France':'Germany','Population':]

         Population      GDP  Surface Area    HDI Continent
France       63.951  2833687        640679  0.888    Europe
Germany      80.940  3874437        357114  0.916    Europe

In [433]:
df.loc['France': 'Italy', ['Population', 'GDP']]

         Population      GDP
France       63.951  2833687
Germany      80.940  3874437
Italy        60.665  2167744

In [435]:
df.iloc[[0, 1, -1]]

               Population       GDP  Surface Area    HDI Continent
Canada             35.467   1785387       9984670  0.913   America
France             63.951   2833687        640679  0.888    Europe
United States     318.523  17348075       9525067  0.915   America

In [437]:
df.iloc[1:3]

         Population      GDP  Surface Area    HDI Continent
France       63.951  2833687        640679  0.888    Europe
Germany      80.940  3874437        357114  0.916    Europe

In [439]:
df.iloc[1:3, [0, 3]]

         Population    HDI
France       63.951  0.888
Germany      80.940  0.916

In [447]:
(df['Population'] > 70).to_frame()

                Population
Canada               False
France               False
Germany               True
Italy                False
Japan                 True
United Kingdom       False
United States         True

In [443]:
df.loc[df['Population'] > 70]

               Population       GDP  Surface Area    HDI Continent
Germany            80.940   3874437        357114  0.916    Europe
Japan             127.061   4602367        377930  0.891      Asia
United States     318.523  17348075       9525067  0.915   America

In [451]:
df.loc[df['Population'] > 70, 'Population'].to_frame()

               Population
Germany            80.940
Japan             127.061
United States     318.523

In [453]:
df.loc[df['Population'] > 70, ['Population', 'GDP']]

               Population       GDP
Germany            80.940   3874437
Japan             127.061   4602367
United States     318.523  17348075

In [455]:
df.drop('Canada')

                Population       GDP  Surface Area    HDI Continent
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [457]:
df.drop(['Canada', 'Japan'])

                Population       GDP  Surface Area    HDI Continent
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [459]:
df.drop(columns=['Population', 'HDI'])

                     GDP  Surface Area Continent
Canada           1785387       9984670   America
France           2833687        640679    Europe
Germany          3874437        357114    Europe
Italy            2167744        301336    Europe
Japan            4602367        377930      Asia
United Kingdom   2950039        242495    Europe
United States   17348075       9525067   America

In [467]:
df.drop(['Italy', 'Canada'], axis=0)

                Population       GDP  Surface Area    HDI Continent
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [469]:
df.drop(['Population', 'HDI'], axis=1)

                     GDP  Surface Area Continent
Canada           1785387       9984670   America
France           2833687        640679    Europe
Germany          3874437        357114    Europe
Italy            2167744        301336    Europe
Japan            4602367        377930      Asia
United Kingdom   2950039        242495    Europe
United States   17348075       9525067   America

In [471]:
df.drop(['Population', 'HDI'], axis='columns')

                     GDP  Surface Area Continent
Canada           1785387       9984670   America
France           2833687        640679    Europe
Germany          3874437        357114    Europe
Italy            2167744        301336    Europe
Japan            4602367        377930      Asia
United Kingdom   2950039        242495    Europe
United States   17348075       9525067   America

In [473]:
df[['Population', 'GDP']] / 100

                Population        GDP
Canada             0.35467   17853.87
France             0.63951   28336.87
Germany            0.80940   38744.37
Italy              0.60665   21677.44
Japan              1.27061   46023.67
United Kingdom     0.64511   29500.39
United States      3.18523  173480.75

In [479]:
crisis = pd.Series([-1_000_000, -0.3], index=['GDP', 'HDI'])
crisis

GDP   -1000000.0
HDI         -0.3
dtype: float64

In [481]:
df[['GDP', 'HDI']] + crisis

                       GDP    HDI
Canada            785387.0  0.613
France           1833687.0  0.588
Germany          2874437.0  0.616
Italy            1167744.0  0.573
Japan            3602367.0  0.591
United Kingdom   1950039.0  0.607
United States   16348075.0  0.615

In [485]:
langs = pd.Series(
    ['French', 'German', 'Italian'],
    index=['France', 'Germany', 'Italy'],
    name='Language'
)
langs

France      French
Germany     German
Italy      Italian
Name: Language, dtype: object

In [489]:
df['Language'] = langs
df

                Population       GDP  Surface Area    HDI Continent Language
Canada              35.467   1785387       9984670  0.913   America      NaN
France              63.951   2833687        640679  0.888    Europe   French
Germany             80.940   3874437        357114  0.916    Europe   German
Italy               60.665   2167744        301336  0.873    Europe  Italian
Japan              127.061   4602367        377930  0.891      Asia      NaN
United Kingdom      64.511   2950039        242495  0.907    Europe      NaN
United States      318.523  17348075       9525067  0.915   America      NaN

In [491]:
df['Language'] = 'English'
df

                Population       GDP  Surface Area    HDI Continent Language
Canada              35.467   1785387       9984670  0.913   America  English
France              63.951   2833687        640679  0.888    Europe  English
Germany             80.940   3874437        357114  0.916    Europe  English
Italy               60.665   2167744        301336  0.873    Europe  English
Japan              127.061   4602367        377930  0.891      Asia  English
United Kingdom      64.511   2950039        242495  0.907    Europe  English
United States      318.523  17348075       9525067  0.915   America  English

In [567]:
df.rename(
    columns={
        'HDI': 'Human Development Index',
        'Anual Popcorn Consumption': 'APC'
    }, index={
        'United States': 'USA',
        'United Kingdom': 'UK',
        'Argentina': 'AR'
    })

,Population,GDP,Surface Area,Human Development Index,Continent,Language
Canada,35.467,1785387,9984670,0.913,America,English
France,63.951,2833687,640679,0.888,Europe,English
Germany,80.940,3874437,357114,0.916,Europe,English
Italy,60.665,2167744,301336,0.873,Europe,English
Japan,127.061,4602367,377930,0.891,Asia,English
UK,64.511,2950039,242495,0.907,Europe,English
USA,318.523,17348075,9525067,0.915,America,English

In [571]:
df.rename(index=str.upper, inplace=False)

                Population       GDP  Surface Area    HDI Continent Language
CANADA              35.467   1785387       9984670  0.913   America  English
FRANCE              63.951   2833687        640679  0.888    Europe  English
GERMANY             80.940   3874437        357114  0.916    Europe  English
ITALY               60.665   2167744        301336  0.873    Europe  English
JAPAN              127.061   4602367        377930  0.891      Asia  English
UNITED KINGDOM      64.511   2950039        242495  0.907    Europe  English
UNITED STATES      318.523  17348075       9525067  0.915   America  English

In [591]:
df.drop(columns='Language', inplace=False)

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [615]:
c=pd.Series({
    'Population': 3,
    'GDP': 5
}, name='China')
df=pd.concat([df,c.to_frame().T])

In [621]:
df

                  Population         GDP  Surface Area    HDI Continent
Canada          3.546700e+01   1785387.0     9984670.0  0.913   America
France          6.395100e+01   2833687.0      640679.0  0.888    Europe
Germany         8.094000e+01   3874437.0      357114.0  0.916    Europe
Italy           6.066500e+01   2167744.0      301336.0  0.873    Europe
Japan           1.270610e+02   4602367.0      377930.0  0.891      Asia
United Kingdom  6.451100e+01   2950039.0      242495.0  0.907    Europe
United States   3.185230e+02  17348075.0     9525067.0  0.915   America
China           3.000000e+00         5.0           NaN    NaN       NaN
India           1.400000e+09         NaN           NaN    NaN      Asia

In [623]:
df.drop('China', inplace=True)
df.drop('India', inplace=True)
df

                Population         GDP  Surface Area    HDI Continent
Canada              35.467   1785387.0     9984670.0  0.913   America
France              63.951   2833687.0      640679.0  0.888    Europe
Germany             80.940   3874437.0      357114.0  0.916    Europe
Italy               60.665   2167744.0      301336.0  0.873    Europe
Japan              127.061   4602367.0      377930.0  0.891      Asia
United Kingdom      64.511   2950039.0      242495.0  0.907    Europe
United States      318.523  17348075.0     9525067.0  0.915   America

In [625]:
df.reset_index()

            index  Population         GDP  Surface Area    HDI Continent
0          Canada      35.467   1785387.0     9984670.0  0.913   America
1          France      63.951   2833687.0      640679.0  0.888    Europe
2         Germany      80.940   3874437.0      357114.0  0.916    Europe
3           Italy      60.665   2167744.0      301336.0  0.873    Europe
4           Japan     127.061   4602367.0      377930.0  0.891      Asia
5  United Kingdom      64.511   2950039.0      242495.0  0.907    Europe
6   United States     318.523  17348075.0     9525067.0  0.915   America

In [643]:
df.set_index('Population')

                   GDP  Surface Area    HDI Continent  GDP Per Capita
Population
35.467       1785387.0     9984670.0  0.913   America    50339.385908
63.951       2833687.0      640679.0  0.888    Europe    44310.284437
80.940       3874437.0      357114.0  0.916    Europe    47868.013343
60.665       2167744.0      301336.0  0.873    Europe    35733.025633
127.061      4602367.0      377930.0  0.891      Asia    36221.712406
64.511       2950039.0      242495.0  0.907    Europe    45729.239975
318.523     17348075.0     9525067.0  0.915   America    54464.120330

In [645]:
(df['GDP'] / df['Population']).to_frame()

                           0
Canada          50339.385908
France          44310.284437
Germany         47868.013343
Italy           35733.025633
Japan           36221.712406
United Kingdom  45729.239975
United States   54464.120330

In [647]:
df['GDP Per Capita'] = df['GDP'] / df['Population']

In [653]:
df

,Population,GDP,Surface Area,HDI,Continent,GDP Per Capita
Canada,35.467,1785387.0,9984670.0,0.913,America,50339.385908
France,63.951,2833687.0,640679.0,0.888,Europe,44310.284437
Germany,80.940,3874437.0,357114.0,0.916,Europe,47868.013343
Italy,60.665,2167744.0,301336.0,0.873,Europe,35733.025633
Japan,127.061,4602367.0,377930.0,0.891,Asia,36221.712406
United Kingdom,64.511,2950039.0,242495.0,0.907,Europe,45729.239975
United States,318.523,17348075.0,9525067.0,0.915,America,54464.120330

In [655]:
df.head()

         Population        GDP  Surface Area    HDI Continent  GDP Per Capita
Canada       35.467  1785387.0     9984670.0  0.913   America    50339.385908
France       63.951  2833687.0      640679.0  0.888    Europe    44310.284437
Germany      80.940  3874437.0      357114.0  0.916    Europe    47868.013343
Italy        60.665  2167744.0      301336.0  0.873    Europe    35733.025633
Japan       127.061  4602367.0      377930.0  0.891      Asia    36221.712406

In [657]:
df.head(10)

,Population,GDP,Surface Area,HDI,Continent,GDP Per Capita
Canada,35.467,1785387.0,9984670.0,0.913,America,50339.385908
France,63.951,2833687.0,640679.0,0.888,Europe,44310.284437
Germany,80.940,3874437.0,357114.0,0.916,Europe,47868.013343
Italy,60.665,2167744.0,301336.0,0.873,Europe,35733.025633
Japan,127.061,4602367.0,377930.0,0.891,Asia,36221.712406
United Kingdom,64.511,2950039.0,242495.0,0.907,Europe,45729.239975
United States,318.523,17348075.0,9525067.0,0.915,America,54464.120330

In [659]:
df.describe()

       Population           GDP  Surface Area       HDI  GDP Per Capita
count    7.000000  7.000000e+00  7.000000e+00  7.000000        7.000000
mean   107.302571  5.080248e+06  3.061327e+06  0.900429    44952.254576
std     97.249970  5.494020e+06  4.576187e+06  0.016592     6954.983875
min     35.467000  1.785387e+06  2.424950e+05  0.873000    35733.025633
25%     62.308000  2.500716e+06  3.292250e+05  0.889500    40265.998421
50%     64.511000  2.950039e+06  3.779300e+05  0.907000    45729.239975
75%    104.000500  4.238402e+06  5.082873e+06  0.914000    49103.699626
max    318.523000  1.734808e+07  9.984670e+06  0.916000    54464.120330

In [679]:
population = df['Population']
population.min(), population.max(),population.sum(),population.sum() / len(population),population.mean(),population.std(),population.median()

(35.467,
 318.523,
 751.118,
 107.30257142857144,
 107.30257142857144,
 97.24996987121581,
 64.511)

In [687]:
population.describe()

count      7.000000
mean     107.302571
std       97.249970
min       35.467000
25%       62.308000
50%       64.511000
75%      104.000500
max      318.523000
Name: Population, dtype: float64

In [689]:
population.quantile(.25)

62.308

In [691]:
population.quantile([.2, .4, .6, .8, 1])

0.2     61.3222
0.4     64.1750
0.6     74.3684
0.8    117.8368
1.0    318.5230
Name: Population, dtype: float64

In [698]:
pd.DataFrame(data=[None],
             index=[None],
             columns=[None])

      None
None  None

In [782]:
marvel_data = [
    ['Spider-Man', 'male', 1962],
    ['Captain America', 'male', 1941],
    ['Wolverine', 'male', 1974],
    ['Iron Man', 'male', 1963],
    ['Thor', 'male', 1963],
    ['Thing', 'male', 1961],
    ['Mister Fantastic', 'male', 1961],
    ['Hulk', 'male', 1962],
    ['Beast', 'male', 1963],
    ['Invisible Woman', 'female', 1961],
    ['Storm', 'female', 1975],
    ['Namor', 'male', 1939],
    ['Hawkeye', 'male', 1964],
    ['Daredevil', 'male', 1964],
    ['Doctor Strange', 'male', 1963],
    ['Hank Pym', 'male', 1962],
    ['Scarlet Witch', 'female', 1964],
    ['Wasp', 'female', 1963],
    ['Black Widow', 'female', 1964],
    ['Vision', 'male', 1968]
]

mdf=pd.DataFrame(marvel_data)
mdf

                   0       1     2
0         Spider-Man    male  1962
1    Captain America    male  1941
2          Wolverine    male  1974
3           Iron Man    male  1963
4               Thor    male  1963
5              Thing    male  1961
6   Mister Fantastic    male  1961
7               Hulk    male  1962
8              Beast    male  1963
9    Invisible Woman  female  1961
10             Storm  female  1975
11             Namor    male  1939
12           Hawkeye    male  1964
13         Daredevil    male  1964
14    Doctor Strange    male  1963
15          Hank Pym    male  1962
16     Scarlet Witch  female  1964
17              Wasp  female  1963
18       Black Widow  female  1964
19            Vision    male  1968

In [784]:
col_names = ['name', 'sex', 'first_appearance']
mdf.columns = col_names

In [786]:
mdf.index = mdf['name']

In [788]:
mdf.drop(['name'],axis=1)

                     sex  first_appearance
name
Spider-Man          male              1962
Captain America     male              1941
Wolverine           male              1974
Iron Man            male              1963
Thor                male              1963
Thing               male              1961
Mister Fantastic    male              1961
Hulk                male              1962
Beast               male              1963
Invisible Woman   female              1961
Storm             female              1975
Namor               male              1939
Hawkeye             male              1964
Daredevil           male              1964
Doctor Strange      male              1963
Hank Pym            male              1962
Scarlet Witch     female              1964
Wasp              female              1963
Black Widow       female              1964
Vision              male              1968

In [790]:
mdf.drop(['Namor','Hank Pym'],axis=0)

                              name     sex  first_appearance
name
Spider-Man              Spider-Man    male              1962
Captain America    Captain America    male              1941
Wolverine                Wolverine    male              1974
Iron Man                  Iron Man    male              1963
Thor                          Thor    male              1963
Thing                        Thing    male              1961
Mister Fantastic  Mister Fantastic    male              1961
Hulk                          Hulk    male              1962
Beast                        Beast    male              1963
Invisible Woman    Invisible Woman  female              1961
Storm                        Storm  female              1975
Hawkeye                    Hawkeye    male              1964
Daredevil                Daredevil    male              1964
Doctor Strange      Doctor Strange    male              1963
Scarlet Witch        Scarlet Witch  female              1964
Wasp                          Wasp  female              1963
Black Widow            Black Widow  female              1964
Vision                      Vision    male              1968

In [792]:
mdf[:5]
#mdf.loc[['Spider-Man', 'Captain America', 'Wolverine', 'Iron Man', 'Thor'], :] # bad!
#mdf.loc['Spider-Man': 'Thor', :]
#mdf.iloc[0:5, :]
#mdf.iloc[0:5,]
# mdf.iloc[:5,]
# mdf.head()

                            name   sex  first_appearance
name
Spider-Man            Spider-Man  male              1962
Captain America  Captain America  male              1941
Wolverine              Wolverine  male              1974
Iron Man                Iron Man  male              1963
Thor                        Thor  male              1963

In [811]:
#mdf.loc[['Hank Pym', 'Scarlet Witch', 'Wasp', 'Black Widow', 'Vision'], :] # bad!
#mdf.loc['Hank Pym':'Vision', :]
#mdf.tail()
# mdf[len(mdf.index)-5:len(mdf.index)]
mdf.iloc[-5:]

                        name     sex  first_appearance
name
Hank Pym            Hank Pym    male              1962
Scarlet Witch  Scarlet Witch  female              1964
Wasp                    Wasp  female              1963
Black Widow      Black Widow  female              1964
Vision                Vision    male              1968

In [827]:
mdf.iloc[1:-1,].first_appearance.to_frame()

                  first_appearance
name
Captain America               1941
Wolverine                     1974
Iron Man                      1963
Thor                          1963
Thing                         1961
Mister Fantastic              1961
Hulk                          1962
Beast                         1963
Invisible Woman               1961
Storm                         1975
Namor                         1939
Hawkeye                       1964
Daredevil                     1964
Doctor Strange                1963
Hank Pym                      1962
Scarlet Witch                 1964
Wasp                          1963
Black Widow                   1964

In [833]:
mdf.iloc[[0, -1]]

                  name   sex  first_appearance
name
Spider-Man  Spider-Man  male              1962
Vision          Vision  male              1968

In [837]:
mdf.loc['Vision', 'first_appearance'] = 1964

In [841]:
mdf['yrs since app']=2024-mdf['first_appearance']
mdf

                              name     sex  first_appearance  yrs since app
name
Spider-Man              Spider-Man    male              1962             62
Captain America    Captain America    male              1941             83
Wolverine                Wolverine    male              1974             50
Iron Man                  Iron Man    male              1963             61
Thor                          Thor    male              1963             61
Thing                        Thing    male              1961             63
Mister Fantastic  Mister Fantastic    male              1961             63
Hulk                          Hulk    male              1962             62
Beast                        Beast    male              1963             61
Invisible Woman    Invisible Woman  female              1961             63
Storm                        Storm  female              1975             49
Namor                        Namor    male              1939             85
Hawkeye                    Hawkeye    male              1964             60
Daredevil                Daredevil    male              1964             60
Doctor Strange      Doctor Strange    male              1963             61
Hank Pym                  Hank Pym    male              1962             62
Scarlet Witch        Scarlet Witch  female              1964             60
Wasp                          Wasp  female              1963             61
Black Widow            Black Widow  female              1964             60
Vision                      Vision    male              1964             60

In [845]:
mdf['sex'] == 'female'

name
Spider-Man          False
Captain America     False
Wolverine           False
Iron Man            False
Thor                False
Thing               False
Mister Fantastic    False
Hulk                False
Beast               False
Invisible Woman      True
Storm                True
Namor               False
Hawkeye             False
Daredevil           False
Doctor Strange      False
Hank Pym            False
Scarlet Witch        True
Wasp                 True
Black Widow          True
Vision              False
Name: sex, dtype: bool

In [847]:
mask=mdf['sex']=='male'
mdf[mask]

                              name   sex  first_appearance  yrs since app
name
Spider-Man              Spider-Man  male              1962             62
Captain America    Captain America  male              1941             83
Wolverine                Wolverine  male              1974             50
Iron Man                  Iron Man  male              1963             61
Thor                          Thor  male              1963             61
Thing                        Thing  male              1961             63
Mister Fantastic  Mister Fantastic  male              1961             63
Hulk                          Hulk  male              1962             62
Beast                        Beast  male              1963             61
Namor                        Namor  male              1939             85
Hawkeye                    Hawkeye  male              1964             60
Daredevil                Daredevil  male              1964             60
Doctor Strange      Doctor Strange  male              1963             61
Hank Pym                  Hank Pym  male              1962             62
Vision                      Vision  male              1964             60